* INPUT PARAMETERS
#+NAME: python_parameters
#+begin_src python :session py1 :var output="OMEGA_MODE"
  import numpy as np

  MESH_FILE = "1901_inv.su2" #"1901_inv.su2"
  MARKERS_FILE = "sbw_1901.txt" #"sbw_1901.txt" # sbw_1901.txt
  NUM_MODES = 5
  SCALING = 0.1
  MACH_NUMBER = 0.75 #0.75#0.735
  FREESTREAM_TEMPERATURE= 216.66#222.773
  FREESTREAM_PRESSURE= 18752.378694043327#26201.65
  R = 287.058
  gamma = 1.4
  FREESTREAM_VELOCITY= MACH_NUMBER * (FREESTREAM_TEMPERATURE * gamma * R) ** 0.5
  FREESTREAM_DENSITY = FREESTREAM_PRESSURE / (FREESTREAM_TEMPERATURE * R)

  ROOT_WING_CHORD = 3.
  TIP_WING_CHORD= 0.7
  WING_SPAN= 28.
  b = ROOT_WING_CHORD/2

  REDUCED_FREQ = (1e-7, 1e-5, 1e-3, 0.01)
  REDUCED_FREQ = (0.03, 0.05, 0.07, 0.1)
  OMEGA_AERO = (6.0947, 21.0989, 25.0699, 40., 82.9318)
  #OMEGA_MODE = tuple([FREESTREAM_VELOCITY * ki / b  for ki in REDUCED_FREQ for i in range(NUM_MODES)])
  OMEGA_MODE = tuple([FREESTREAM_VELOCITY * ki / b for ki in REDUCED_FREQ])
  AMPL_MODE = [0. for i in range(NUM_MODES)]
  AMPL_MODE[0] = 0.1
  AMPL_MODE = tuple(AMPL_MODE)
  OMEGA_HB = tuple([FREESTREAM_VELOCITY * ki / b for ki in REDUCED_FREQ])#tuple([0, OMEGA_MODE0, -OMEGA_MODE0])
  HB_PERIOD = tuple([2 * np.pi / i for i in OMEGA_HB])

  # (1/3) * π * h * (r² + r * R + R²)
  WING_VOL_TRUN_CONE= 1./3 * np.pi * (WING_SPAN) * ((TIP_WING_CHORD * 0.5)**2 +
      TIP_WING_CHORD * 0.5 * ROOT_WING_CHORD *0.5 + (ROOT_WING_CHORD * 0.5)**2)

  WING_VOL_TRUN_CONE = 1.1
  rho_mat = 400.
  Omega = 6.0947#OMEGA_HB[0]
  # m
  SCALE_PARAM = 1. / (WING_VOL_TRUN_CONE * rho_mat)

  # mu
  AIRFOIL_MASS_RATIO = (WING_VOL_TRUN_CONE * rho_mat) / (np.pi *
                        FREESTREAM_DENSITY * (ROOT_WING_CHORD / 2)**2)

  # FLUTTER_SPEED_INDEX = U/(mu**0.5 * b * omega0)
  # %% (TgammaR) = ((vf*vf)*(b*b)*(w_alpha*w_alpha)*mu) / (Mach*Mach)
  FLUTTER_SPEED_INDEX = MACH_NUMBER * ((FREESTREAM_TEMPERATURE * gamma * R) ** 0.5 /
                         ((b * Omega) * AIRFOIL_MASS_RATIO**0.5))
  #FLUTTER_SPEED_INDEX = 0.00227
  eval(output)
#+end_src

#+RESULTS: python_parameters
| 4.426184098995431 | 7.376973498325718 | 10.327762897656006 | 14.753946996651436 |

#+NAME: python_parameters2
#+begin_src python :session py1 :var ki=1 output="HB_PERIODX" :noweb yes
  ##<<python_parameters>>
  OMEGA_MODE0 = FREESTREAM_VELOCITY * ki / 2
  OMEGA_MODEX = tuple([OMEGA_MODE0 for i in range(NUM_MODES)])
  OMEGA_HBX = tuple([0, OMEGA_MODE0, -OMEGA_MODE0])
  HB_PERIODX = 2 * np.pi / OMEGA_MODE0
  eval(output)
#+end_src

#+RESULTS: python_parameters2
: 0.05678196086426339


#+begin_src bash :results output :noweb yes
  c=0
  n=9
  OMEGA_MODE=<<python_parameters("OMEGA_MODE")>>
  HB_PERIOD=<<python_parameters("HB_PERIOD")>>
    for ki in ${OMEGA_MODE[@]}
      do
      echo "#####"
    done
  OMEGA_MODE1=(1 2 3 4 5 6)
  #echo ${OMEGA_MODE1[*]:1:5}
  #echo ${OMEGA_MODE[4]}
  #echo $(($((c+1))*$n))
  #echo ${HB_PERIOD[$c]}
  echo ${OMEGA_MODE1[@]:0:3}
#+end_src

#+RESULTS:
: #####
: #####
: #####
: #####
: 1 2 3

* Modal shapes workflow
#+NAME: ModalShapes
#+header: 
#+begin_src bash :noweb yes :dir (print program_dir0) :shebang #!/usr/bin/zsh :results output :var OUTPUT_DIR=(print mesh_deformation_tangle) dir1=(print local_root) NUM_MODES1=(print NUM_MODES) SCALING1=(print SCALING) :tangle (print (concat mesh_deformation_tangle "/generate_modes.sh")) :async

  MARKERS_FILE=<<python_parameters(output="MARKERS_FILE")>>
  echo $dir1
  PYTHONPATH=$PYTHONPATH:$dir1
  python examples/write_cam_modes.py -m $NUM_MODES1 -s $SCALING1 -f filter_sigmoid -d $OUTPUT_DIR -a $MARKERS_FILE
#+end_src

#+RESULTS: ModalShapes
#+begin_example
/home/ac5015/programs/RHEAtools/examples/..
Modes scaling: 0.1
Modes : [0, 1, 2, 3, 4]
Filtering : <function filter_sigmoid at 0x7f5970f6feb0>
Directory : /home/ac5015/programs/RHEAtools/examples/../data/out/ONERA_fac0.1/MeshDeformation_mesh1901
MARKERS_FILE : ./data/in/sbw_1901.txt
DEBUG:   bdf.py:1001                  ---starting BDF.read_bdf of ./data/in/SOL103/polimi-103cam.bdf---
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/polimi-103cam.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/stick_wing.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/stick_fus.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/stick_vtail.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/stick_htail.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/stick_strut_corrected.bdf'
DEBUG:   pybdf.py:558                 opening '/home/ac5015/programs/RHEAtools/data/in/SOL103/mass_wing.bdf'
DEBUG:   cross_reference.py:151       Cross Referencing...
DEBUG:   bdf.py:1049                  ---finished BDF.read_bdf of ./data/in/SOL103/polimi-103cam.bdf---
---BDF Statistics---
SOL 103

bdf.spcadds[1000]: 1
  SPCADD:  1

bdf.spcs[100001]: 1
  SPC1:    1

bdf.params: 6
  PARAM    : 6

bdf.nodes: 875
  GRID     : 875

bdf.elements: 170
  CBAR     : 170

bdf.rigid_elements: 181
  RBE2     : 181

bdf.properties: 138
  PBAR     : 138

bdf.masses: 328
  CONM2    : 328

bdf.materials: 5
  MAT1     : 5

bdf.methods: 1
  EIGRL    : 1


DEBUG:   op2.py:542                   combine=True
DEBUG:   op2.py:543                   -------- reading op2 with read_mode=1 (array sizing) --------
INFO:    op2_scalar.py:1672           op2_filename = './data/in/SOL103/polimi-103cam.op2'
DEBUG:   op2_reader.py:231            date = (3, 16, 23)
DEBUG:   op2_reader.py:302            mode = 'msc'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM1'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM2'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM4'
DEBUG:   op2_scalar.py:1850             table_name=b'EPT'
DEBUG:   op2_scalar.py:1850             table_name=b'MPT'
DEBUG:   op2_scalar.py:1850             table_name=b'DYNAMICS'
DEBUG:   op2_scalar.py:1850             table_name=b'CASECC'
DEBUG:   op2_scalar.py:1850             table_name=b'OUG1'
DEBUG:   op2.py:562                   -------- reading op2 with read_mode=2 (array filling) --------
DEBUG:   op2_reader.py:231            date = (3, 16, 23)
DEBUG:   op2_reader.py:302            mode = 'msc'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM1'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM2'
DEBUG:   op2_scalar.py:1850             table_name=b'GEOM4'
DEBUG:   op2_scalar.py:1850             table_name=b'EPT'
DEBUG:   op2_scalar.py:1850             table_name=b'MPT'
DEBUG:   op2_scalar.py:1850             table_name=b'DYNAMICS'
DEBUG:   op2_scalar.py:1850             table_name=b'CASECC'
DEBUG:   op2_scalar.py:1850             table_name=b'OUG1'
DEBUG:   op2.py:859                   combine_results
DEBUG:   op2.py:575                   finished reading op2
loadcases = [1]
times = [  1.   2.   3.   4.   5.   6.   7.   8.   9.  10.  11.  12.  13.  14.
  15.  16.  17.  18.  19.  20.  21.  22.  23.  24.  25.  26.  27.  28.
  29.  30.  31.  32.  33.  34.  35.  36.  37.  38.  39.  40.  41.  42.
  43.  44.  45.  46.  47.  48.  49.  50.  51.  52.  53.  54.  55.  56.
  57.  58.  59.  60.  61.  62.  63.  64.  65.  66.  67.  68.  69.  70.
  71.  72.  73.  74.  75.  76.  77.  78.  79.  80.  81.  82.  83.  84.
  85.  86.  87.  88.  89.  90.  91.  92.  93.  94.  95.  96.  97.  98.
  99. 100. 101. 102. 103. 104. 105. 106. 107. 108. 109. 110. 111. 112.
 113. 114. 115. 116. 117. 118. 119. 120. 121. 122. 123. 124. 125. 126.
 127. 128. 129. 130. 131. 132. 133. 134. 135. 136. 137. 138. 139. 140.
 141. 142. 143. 144. 145. 146. 147. 148. 149. 150.]

#+end_example

** Copy files to HPC and run steady
#+NAME: HPC_HB
#+header: :noweb yes :var LOCAL_DIR=(print local_dir) LOCAL_ROOT=(print local_root) REMOTE_DIR=(print remote_dir) HBDIR=(print hb_dir) NUM_MODES1=(print NUM_MODES) MeshDeformation=(print mesh_deformation_dir) :results output
#+begin_src shell :tangle (print (concat HB_tangle "/hpc.sh")) :mkdirp yes :shebang   #!/usr/bin/zsh
  run_qsub=true
  REDUCED_FREQ=<<python_parameters("REDUCED_FREQ")>>
  echo "Running HB"
  OMEGA_MODE=<<python_parameters("OMEGA_MODE")>>
  OMEGA_HB=<<python_parameters("OMEGA_HB")>>
  HB_PERIOD=<<python_parameters("HB_PERIOD")>>
  echo ${REDUCED_FREQ[@]}
  echo ${HB_PERIOD[@]}
  counter=0
  for ki in "${REDUCED_FREQ[@]}"
    do
    #OMEGA_MODEX=${OMEGA_MODE[*]:$(($counter*$NUM_MODES1)):$(($((counter+1))*$NUM_MODES1))}
    OMEGA_MODEX=( $(for i in {1..$NUM_MODES1}; do echo 0; done) )
    OMEGA_MODEX[1]=${OMEGA_MODE[@]:$counter:1}
    HB_PERIODX=${HB_PERIOD[@]:$counter:1}
    OMEGA_HBX=${OMEGA_HB[@]:$counter:1}
    echo Reduced frequency: $ki
    echo $counter
    echo $HB_PERIODX
    mkdir -p $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/K$ki/
    sshpass -f $LOCAL_ROOT/examples/pas ssh ac5015@login.hpc.imperial.ac.uk "mkdir -p $HOME/$REMOTE_DIR/$HBDIR/K$ki"
    echo "hello"
    sed "s|OMEGA_MODE=.*|OMEGA_MODE= $OMEGA_MODEX|" $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/euler-onera0.cfg > $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/K$ki/euler_onera.cfg
    sed -i "s|OMEGA_HB=.*|OMEGA_HB= (0. $OMEGA_HBX -$OMEGA_HBX)|" $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/K$ki/euler_onera.cfg
    sed -i "s|HB_PERIOD=.*|HB_PERIOD= $HB_PERIODX |" $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/K$ki/euler_onera.cfg
    counter=$(($counter+1))

    echo "Copying files to HPC"
    sshpass -f $LOCAL_ROOT/examples/pas scp $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/K$ki/euler_onera.cfg ac5015@login.hpc.imperial.ac.uk:$HOME/$REMOTE_DIR/$HBDIR/K$ki/euler_onera.cfg
    sshpass -f $LOCAL_ROOT/examples/pas scp $LOCAL_ROOT/$LOCAL_DIR/$HBDIR/run.pbs ac5015@login.hpc.imperial.ac.uk:$HOME/$REMOTE_DIR/$HBDIR/K$ki/run.pbs
    sshpass -f $LOCAL_ROOT/examples/pas scp 					$LOCAL_ROOT/$LOCAL_DIR/$MeshDeformation/SU2_mesh/StructuralModel.vertices ac5015@login.hpc.imperial.ac.uk:$HOME/$REMOTE_DIR/$HBDIR/K$ki/StructuralModel.vertices
    echo "Copying modes"
    for i in {0..$(($NUM_MODES1-1))..1}
        do
        echo "Mode: $i"
        sshpass -f $LOCAL_ROOT/examples/pas scp $LOCAL_ROOT/$LOCAL_DIR/$MeshDeformation/SU2_mesh/StructuralModel.mode$(($i+1)) ac5015@login.hpc.imperial.ac.uk:$HOME/$REMOTE_DIR/$HBDIR/K$ki/StructuralModel.mode$(($i+1))
    done
    if [[ $run_qsub = true ]]; then
    echo "submitting qsub"
    sshpass -f $LOCAL_ROOT/examples/pas ssh ac5015@login.hpc.imperial.ac.uk << EOF
    cd $HOME/$REMOTE_DIR/$HBDIR/K$ki/
       qsub run.pbs
    exit
  EOF
    fi
  done
#+end_src

#+RESULTS: HPC_HB
: Running HB
: 1e-07
: 0.1
: 0.3
: 0.5

*** Orchestrator_MeshDeformation
#+NAME: Orchestrator_MeshDeformation
#+begin_src bash :dir (print mesh_deformation_tangle) :shebang #!/usr/bin/zsh :results output :async
  echo Current directory:
  pwd
  echo RUNNING hpc.sh
  zsh hpc.sh
#+end_src

#+RESULTS: Orchestrator_MeshDeformation
#+begin_example
Current directory:
/home/ac5015/programs/RHEAtools/data/out/ONERA_fac50.0/MeshDeformation_mesh1901
RUNNING hpc.sh
Copying Interpolated Mode 0
Submitting Mode 0
7265080.pbs
Copying Interpolated Mode 1
Submitting Mode 1
7265082.pbs
Copying Interpolated Mode 2
Submitting Mode 2
7265083.pbs
Copying Interpolated Mode 3
Submitting Mode 3
7265084.pbs
Copying Interpolated Mode 4
Submitting Mode 4
7265086.pbs
#+end_example

*** Orchestrator_RecoverParaview
#+NAME: Orchestrator_RecoverParaview
#+begin_src bash :dir (print mesh_deformation_tangle) :shebang #!/usr/bin/zsh :results output :async
  echo Recovering paraview modal shapes:
  echo retrieve_deformedmesh.sh
  zsh retrieve_deformedmesh.sh
#+end_src

#+RESULTS: Orchestrator_RecoverParaview
: Recovering paraview modal shapes:
: retrieve_deformedmesh.sh
: Copying surface_deformed.vtu from Mode 0
: Copying surface_deformed.vtu from Mode 1
: Copying surface_deformed.vtu from Mode 2
: Copying surface_deformed.vtu from Mode 3
: Copying surface_deformed.vtu from Mode 4

*** Run Steady simulations
#+NAME: Orchestrator_SteadyModes
#+header: 
#+begin_src bash :dir (print steady_deformation_tangle) :shebang #!/usr/bin/zsh :results output 
  echo Current directory:
  pwd
  echo ####################
  echo RUNNING hpc.sh
  zsh hpc.sh
#+end_src

#+RESULTS: Orchestrator_SteadyModes
#+begin_example
Current directory:
/home/ac5015/programs/RHEAtools/data/out/ONERA_fac1.0/SteadyModes_mesh1901

RUNNING hpc.sh
Running Steady on reference config
7304545.pbs
Creating and copying config file for Mode 0
Copying .cfg
Copying run.pbs
7304547.pbs
Creating and copying config file for Mode 1
Copying .cfg
Copying run.pbs
7304549.pbs
Creating and copying config file for Mode 2
Copying .cfg
Copying run.pbs
7304551.pbs
Creating and copying config file for Mode 3
Copying .cfg
Copying run.pbs
7304552.pbs
Creating and copying config file for Mode 4
Copying .cfg
Copying run.pbs
7304553.pbs
#+end_example

*** Run Steady simulations
#+NAME: Orchestrator_HB
#+begin_src bash :dir (print HB_tangle) :shebang #!/usr/bin/zsh :results output
  echo Current directory:
  pwd
  echo ####################
  echo RUNNING hpc.sh
  #zsh hpc.sh
#+end_src

#+RESULTS: Orchestrator_HB
: Current directory:
: /home/ac5015/programs/RHEAtools/data/out/ONERA_fac0.1/HB_mesh1901
: 
: RUNNING hpc.sh


